svhelper/-SPL-/Inc/STM32F1xx/stm32f1xx_clock.hpp
#ifndef __stm32f1xx_clock_hpp__
#define __stm32f1xx_clock_hpp__

#ifndef __cplusplus
# error "This file must be included to the C++ progect"
#endif /*__cplusplus*/

//////////////////////////////////////////////////////////////////////////
#include <stdint.h>
#include <stdbool.h>
#include <static_assert.hpp>

#include <clock.hpp>

//////////////////////////////////////////////////////////////////////////
#include "CMSIS/Device/ST/STM32F1xx/Include/stm32f1xx.h"

/************************************************************************/
/*                                                                      */
/************************************************************************/
namespace mcu {
namespace stm32 {
namespace clock {

	//////////////////////////////////////////////////////////////////////////
	namespace limits {
		static const uint32_t USB_PPM	= 2500;

		class max
		{
		public:
			static const uint32_t SYSCLK	= __MCU_MAX_FREQUENCY_HZ;

			static const uint32_t HSECLK	= 25000000UL;
			static const uint32_t LSECLK	= 1000000UL;
		
			static const uint32_t HCLK		= SYSCLK;
			static const uint32_t USBCLK	= (uint32_t)(48000000UL * (1.E6 + USB_PPM) / 1.E6);
			static const uint32_t APB1CLK	= 36000000UL;
			static const uint32_t APB2CLK	= SYSCLK;
			static const uint32_t ADCCLK	= 14000000UL;

			static const uint32_t FLASHCLK_LATENCY_0_Hz	= 24000000UL;			// Zero wait state
			static const uint32_t FLASHCLK_LATENCY_1_Hz	= 48000000UL;			// One wait state
			static const uint32_t FLASHCLK_LATENCY_2_Hz	= 72000000UL;			// Two wait states
		};

		class min
		{
		public:
			static const uint32_t SYSCLK	= 1UL;

			static const uint32_t HSECLK	= 1000000UL;
			static const uint32_t LSECLK	= 1UL;
		
			static const uint32_t HCLK		= 1UL;
			static const uint32_t USBCLK	= (uint32_t)(48000000UL * (1.E6 - USB_PPM) / 1.E6);
			static const uint32_t APB1CLK	= 1UL;	// 10000000UL;
			static const uint32_t APB2CLK	= 1UL;
			static const uint32_t ADCCLK	= 1UL;
		};
	} // namespace limits
	
	//////////////////////////////////////////////////////////////////////////
	namespace config {
		
		template < ::mcu::clock::osc_type::osc_type type, uint32_t Clock_Hz, ::mcu::clock::state::state state, int32_t calibration = ::mcu::clock::CALIBRATION_DEF>
		class osc_cfg;

		//------------------------------------------------------------------------
		template <uint32_t Clock_Hz, ::mcu::clock::state::state state, int32_t calibration>
		class osc_cfg< ::mcu::clock::osc_type::high_speed_internal, Clock_Hz, state, calibration>
		{
		private:
			static const int32_t calibration_val = (calibration == ::mcu::clock::CALIBRATION_DEF) ? HSI_CALIBRATION_DEFAULT : calibration;
		
			STATIC_ASSERT(Clock_Hz == HSI_VALUE, "HSI clock is invalid");
			STATIC_ASSERT(calibration_val >= 0x00 && calibration_val <= 0x1F, "HSI calibration value out of range");
		
			static const uint32_t _RCC_CR_HSION_BB	= FROM_ADDRESS_BIT_POS_TO_BB(&RCC->CR, RCC_CR_HSION_Pos);
			static const uint32_t _RCC_CR_HSIRDY_BB	= FROM_ADDRESS_BIT_POS_TO_BB(&RCC->CR, RCC_CR_HSIRDY_Pos);

		public:
			static const ::mcu::clock::osc_type::osc_type	_OscType		= ::mcu::clock::osc_type::high_speed_internal;
			static const uint32_t							_Clock_Hz		= Clock_Hz;
			static const ::mcu::clock::state::state			_State			= state;
			static const int32_t							_Calibration	= calibration_val;
		
			static const uint32_t							_pll_prediv		= 1;
			static const bool								_usb_div_1_5	= false;
			static const uint32_t							_pll_mul		= 1;
			static const uint32_t							_usb_clock		= 0;
			static const bool								_usb_active		= false;
		
			static void init()
			{
				(_State == ::mcu::clock::state::enable) ? start() : stop();
				
				/* Adjusts the Internal High Speed oscillator (HSI) calibration value.*/
				MODIFY_REG(RCC->CR, RCC_CR_HSITRIM_Msk, (uint32_t)_Calibration << RCC_CR_HSITRIM_Pos);
			}
			
			static void enable(::mcu::clock::state::state new_state)
			{
				(new_state == ::mcu::clock::state::enable) ? start() : stop();
			}
			
			static void start()
			{
				// enabling
				SET_BB_REG(_RCC_CR_HSION_BB);

				/* Wait till HSI is ready */
				while(IS_BB_REG_RESET(_RCC_CR_HSIRDY_BB)) {}
			}
			
			static void stop()
			{
				// disabling
				RESET_BB_REG(_RCC_CR_HSION_BB);

				/* Wait till HSI is ready */
				while(IS_BB_REG_SET(_RCC_CR_HSIRDY_BB)) {}
			}
		};

		//------------------------------------------------------------------------
		template <uint32_t Clock_Hz, ::mcu::clock::state::state state, int32_t calibration>
		class osc_cfg< ::mcu::clock::osc_type::low_speed_internal, Clock_Hz, state, calibration >
		{
		private:
			STATIC_ASSERT(Clock_Hz == LSI_VALUE, "LSI clock is invalid");
			STATIC_ASSERT(calibration == ::mcu::clock::CALIBRATION_DEF, "LSI has not calibration");
		
			static const uint32_t _RCC_CSR_LSION_BB		= FROM_ADDRESS_BIT_POS_TO_BB(&RCC->CSR, RCC_CSR_LSION_Pos);
			static const uint32_t _RCC_CSR_LSIRDY_BB	= FROM_ADDRESS_BIT_POS_TO_BB(&RCC->CSR, RCC_CSR_LSIRDY_Pos);

		public:
			static const ::mcu::clock::osc_type::osc_type	_OscType		= ::mcu::clock::osc_type::low_speed_internal;
			static const uint32_t							_Clock_Hz		= Clock_Hz;
			static const ::mcu::clock::state::state			_State			= state;
			static const int32_t							_Calibration	= calibration;
		
			static const uint32_t							_pll_prediv		= 1;
			static const bool								_usb_div_1_5	= false;
			static const uint32_t							_pll_mul		= 1;
			static const uint32_t							_usb_clock		= 0;
			static const bool								_usb_active		= false;

			static void init()
			{
				(_State == ::mcu::clock::state::enable) ? start() : stop();
			}
			
			static void enable(::mcu::clock::state::state new_state)
			{
				(new_state == ::mcu::clock::state::enable) ? start() : stop();
			}
			
			static void start()
			{
				// enabling
				SET_BB_REG(_RCC_CSR_LSION_BB);

				/* Wait till LSI is ready */
				while(IS_BB_REG_RESET(_RCC_CSR_LSIRDY_BB)) {}

				/*  To have a fully stabilized clock in the specified range, a software delay of 1ms should be added.*/
				//HAL_Delay(1);
			}
			
			static void stop()
			{
				// disabling
				RESET_BB_REG(_RCC_CSR_LSION_BB);

				/* Wait till LSI is ready */
				while(IS_BB_REG_SET(_RCC_CSR_LSIRDY_BB)) {}
			}
		};

		//------------------------------------------------------------------------
		template <uint32_t Clock_Hz, ::mcu::clock::state::state state, int32_t calibration>
		class osc_cfg< ::mcu::clock::osc_type::high_speed_external, Clock_Hz, state, calibration>
		{
		private:
			STATIC_ASSERT(Clock_Hz >= mcu::stm32::clock::limits::min::HSECLK && Clock_Hz <= mcu::stm32::clock::limits::max::HSECLK, "HSE clock out of range");
			STATIC_ASSERT(calibration == ::mcu::clock::CALIBRATION_DEF, "HSE has not calibration");
		
			static const uint32_t _RCC_CR_HSEON_BB	= FROM_ADDRESS_BIT_POS_TO_BB(&RCC->CR, RCC_CR_HSEON_Pos);
			static const uint32_t _RCC_CR_HSEBYP_BB	= FROM_ADDRESS_BIT_POS_TO_BB(&RCC->CR, RCC_CR_HSEBYP_Pos);
			static const uint32_t _RCC_CR_HSERDY_BB	= FROM_ADDRESS_BIT_POS_TO_BB(&RCC->CR, RCC_CR_HSERDY_Pos);

