svhelper/-SPL-/Inc/STM32F1xx/stm32f1xx_clock.hpp
		public:
			static const ::mcu::clock::osc_type::osc_type	_OscType		= ::mcu::clock::osc_type::high_speed_external;
			static const uint32_t							_Clock_Hz		= Clock_Hz;
			static const ::mcu::clock::state::state			_State			= state;
			static const int32_t							_Calibration	= calibration;

			static const uint32_t							_pll_prediv		= 1;
			static const bool								_usb_div_1_5	= false;
			static const uint32_t							_pll_mul		= 1;
			static const uint32_t							_usb_clock		= 0;
			static const bool								_usb_active		= false;
		
			static void init()
			{
				(_State == ::mcu::clock::state::enable) ? start() : stop();
			}
			
			static void enable(::mcu::clock::state::state new_state)
			{
				(new_state == ::mcu::clock::state::enable) ? start() : stop();
			}
			
			static void start()
			{
				// enabling
				RESET_BB_REG(_RCC_CR_HSEON_BB);
				__NOP();
				RESET_BB_REG(_RCC_CR_HSEBYP_BB);
				SET_BB_REG(_RCC_CR_HSEON_BB);

				/* Wait till HSE is ready */
				while(IS_BB_REG_RESET(_RCC_CR_HSERDY_BB)) {}
			}
			
			static void stop()
			{
				// disabling
				RESET_BB_REG(_RCC_CR_HSEON_BB);

				/* Wait till HSI is ready */
				while(IS_BB_REG_SET(_RCC_CR_HSERDY_BB)) {}
				
				RESET_BB_REG(_RCC_CR_HSEBYP_BB);
			}
		};

		//------------------------------------------------------------------------
		template <uint32_t Clock_Hz, ::mcu::clock::state::state state, int32_t calibration>
		class osc_cfg< ::mcu::clock::osc_type::high_speed_external_bypass, Clock_Hz, state, calibration>
		{
		private:
			STATIC_ASSERT(Clock_Hz >= mcu::stm32::clock::limits::min::HSECLK && Clock_Hz <= mcu::stm32::clock::limits::max::HSECLK, "HSE clock out of range");
			STATIC_ASSERT(calibration == ::mcu::clock::CALIBRATION_DEF, "HSE has not calibration");
		
			static const uint32_t _RCC_CR_HSEON_BB	= FROM_ADDRESS_BIT_POS_TO_BB(&RCC->CR, RCC_CR_HSEON_Pos);
			static const uint32_t _RCC_CR_HSEBYP_BB	= FROM_ADDRESS_BIT_POS_TO_BB(&RCC->CR, RCC_CR_HSEBYP_Pos);
			static const uint32_t _RCC_CR_HSERDY_BB	= FROM_ADDRESS_BIT_POS_TO_BB(&RCC->CR, RCC_CR_HSERDY_Pos);

		public:
			static const ::mcu::clock::osc_type::osc_type	_OscType		= ::mcu::clock::osc_type::high_speed_external_bypass;
			static const uint32_t							_Clock_Hz		= Clock_Hz;
			static const ::mcu::clock::state::state			_State			= state;
			static const int32_t							_Calibration	= calibration;

			static const uint32_t							_pll_prediv		= 1;
			static const bool								_usb_div_1_5	= false;
			static const uint32_t							_pll_mul		= 1;
			static const uint32_t							_usb_clock		= 0;
			static const bool								_usb_active		= false;
		
			static void init()
			{
				(_State == ::mcu::clock::state::enable) ? start() : stop();
			}
			
			static void enable(::mcu::clock::state::state new_state)
			{
				(new_state == ::mcu::clock::state::enable) ? start() : stop();
			}
			
			static void start()
			{
				// enabling
				RESET_BB_REG(_RCC_CR_HSEON_BB);
				__NOP();
				SET_BB_REG(_RCC_CR_HSEBYP_BB);
				SET_BB_REG(_RCC_CR_HSEON_BB);

				/* Wait till HSE is ready */
				while(IS_BB_REG_RESET(_RCC_CR_HSERDY_BB)) {}
			}
			
			static void stop()
			{
				// disabling
				RESET_BB_REG(_RCC_CR_HSEON_BB);

				/* Wait till HSI is ready */
				while(IS_BB_REG_SET(_RCC_CR_HSERDY_BB)) {}
				
				RESET_BB_REG(_RCC_CR_HSEBYP_BB);
			}
		};

		//------------------------------------------------------------------------
		template <uint32_t Clock_Hz, ::mcu::clock::state::state state, int32_t calibration>
		class osc_cfg< ::mcu::clock::osc_type::low_speed_external, Clock_Hz, state, calibration>
		{
		private:
			STATIC_ASSERT(Clock_Hz >= mcu::stm32::clock::limits::min::LSECLK && Clock_Hz <= mcu::stm32::clock::limits::max::LSECLK, "LSE clock out of range");
			STATIC_ASSERT(calibration == ::mcu::clock::CALIBRATION_DEF, "LSE has not calibration");
		
			static const uint32_t _RCC_APB1ENR_PWREN_BB	= FROM_ADDRESS_BIT_POS_TO_BB(&RCC->APB1ENR, RCC_APB1ENR_PWREN_Pos);
			static const uint32_t _PWR_CR_DBP_BB		= FROM_ADDRESS_BIT_POS_TO_BB(&PWR->CR, PWR_CR_DBP_Pos);
			
			static const uint32_t _RCC_BDCR_LSEON_BB	= FROM_ADDRESS_BIT_POS_TO_BB(&RCC->BDCR, RCC_BDCR_LSEON_Pos);
			static const uint32_t _RCC_BDCR_LSEBYP_BB	= FROM_ADDRESS_BIT_POS_TO_BB(&RCC->BDCR, RCC_BDCR_LSEBYP_Pos);
			static const uint32_t _RCC_BDCR_LSERDY_BB	= FROM_ADDRESS_BIT_POS_TO_BB(&RCC->BDCR, RCC_BDCR_LSERDY_Pos);

		public:
			static const ::mcu::clock::osc_type::osc_type	_OscType		= ::mcu::clock::osc_type::low_speed_external;
			static const uint32_t							_Clock_Hz		= Clock_Hz;
			static const ::mcu::clock::state::state			_State			= state;
			static const int32_t							_Calibration	= calibration;

			static const uint32_t							_pll_prediv		= 1;
			static const bool								_usb_div_1_5	= false;
			static const uint32_t							_pll_mul		= 1;
			static const uint32_t							_usb_clock		= 0;
			static const bool								_usb_active		= false;
		
			static void init()
			{
				(_State == ::mcu::clock::state::enable) ? start() : stop();
			}
			
			static void enable(::mcu::clock::state::state new_state)
			{
				(new_state == ::mcu::clock::state::enable) ? start() : stop();
			}
			
			static void start()
			{
				// enabling
				/* Enable Power Clock*/
				SET_BB_REG(_RCC_APB1ENR_PWREN_BB);
				__NOP();

				  /* Enable write access to Backup domain */
				  SET_BB_REG(_PWR_CR_DBP_BB);

				while(IS_BB_REG_RESET(_PWR_CR_DBP_BB)) {}

				/* Set the new LSE configuration */
				RESET_BB_REG(_RCC_BDCR_LSEON_BB);
				__NOP();
				RESET_BB_REG(_RCC_BDCR_LSEBYP_BB);
				SET_BB_REG(_RCC_BDCR_LSEON_BB);

				/* Wait till LSE is ready */  
				while(IS_BB_REG_RESET(_RCC_BDCR_LSERDY_BB)) {}
			}
			
			static void stop()
			{
				// disabling
				/* Set the new LSE configuration */
				RESET_BB_REG(_RCC_BDCR_LSEON_BB);

				/* Wait till LSE is ready */  
				while(IS_BB_REG_SET(_RCC_BDCR_LSERDY_BB)) {}

				RESET_BB_REG(_RCC_BDCR_LSEBYP_BB);
			}
		};

		//------------------------------------------------------------------------
		template <uint32_t Clock_Hz, ::mcu::clock::state::state state, int32_t calibration>
		class osc_cfg< ::mcu::clock::osc_type::low_speed_external_bypass, Clock_Hz, state, calibration>
		{
		private:
			STATIC_ASSERT(Clock_Hz >= mcu::stm32::clock::limits::min::LSECLK && Clock_Hz <= mcu::stm32::clock::limits::max::LSECLK, "LSE clock out of range");
			STATIC_ASSERT(calibration == ::mcu::clock::CALIBRATION_DEF, "LSE has not calibration");
		
			static const uint32_t _RCC_APB1ENR_PWREN_BB	= FROM_ADDRESS_BIT_POS_TO_BB(&RCC->APB1ENR, RCC_APB1ENR_PWREN_Pos);
			static const uint32_t _PWR_CR_DBP_BB		= FROM_ADDRESS_BIT_POS_TO_BB(&PWR->CR, PWR_CR_DBP_Pos);
			
			static const uint32_t _RCC_BDCR_LSEON_BB	= FROM_ADDRESS_BIT_POS_TO_BB(&RCC->BDCR, RCC_BDCR_LSEON_Pos);
			static const uint32_t _RCC_BDCR_LSEBYP_BB	= FROM_ADDRESS_BIT_POS_TO_BB(&RCC->BDCR, RCC_BDCR_LSEBYP_Pos);
			static const uint32_t _RCC_BDCR_LSERDY_BB	= FROM_ADDRESS_BIT_POS_TO_BB(&RCC->BDCR, RCC_BDCR_LSERDY_Pos);

