svhelper/-SPL-/Inc/STM32F1xx/stm32f1xx_clock.hpp
		public:
			static const ::mcu::clock::osc_type::osc_type	_OscType		= ::mcu::clock::osc_type::low_speed_external_bypass;
			static const uint32_t							_Clock_Hz		= Clock_Hz;
			static const ::mcu::clock::state::state			_State			= state;
			static const int32_t							_Calibration	= calibration;

			static const uint32_t							_pll_prediv		= 1;
			static const bool								_usb_div_1_5	= false;
			static const uint32_t							_pll_mul		= 1;
			static const uint32_t							_usb_clock		= 0;
			static const bool								_usb_active		= false;
		
			static void init()
			{
				(_State == ::mcu::clock::state::enable) ? start() : stop();
			}
			
			static void enable(::mcu::clock::state::state new_state)
			{
				(new_state == ::mcu::clock::state::enable) ? start() : stop();
			}
			
			static void start()
			{
				// enabling
				/* Enable Power Clock*/
				SET_BB_REG(_RCC_APB1ENR_PWREN_BB);
				__NOP();

				/* Enable write access to Backup domain */
				SET_BB_REG(_PWR_CR_DBP_BB);

				while(IS_BB_REG_RESET(_PWR_CR_DBP_BB)) {}

				/* Set the new LSE configuration */
				RESET_BB_REG(_RCC_BDCR_LSEON_BB);
				__NOP();
				SET_BB_REG(_RCC_BDCR_LSEBYP_BB);
				SET_BB_REG(_RCC_BDCR_LSEON_BB);

				/* Wait till LSE is ready */  
				while(IS_BB_REG_RESET(_RCC_BDCR_LSERDY_BB)) {}
			}
			
			static void stop()
			{
				// disabling
				/* Set the new LSE configuration */
				RESET_BB_REG(_RCC_BDCR_LSEON_BB);

				/* Wait till LSE is ready */  
				while(IS_BB_REG_SET(_RCC_BDCR_LSERDY_BB)) {}

				RESET_BB_REG(_RCC_BDCR_LSEBYP_BB);
			}
		};
	} // namespace config

	//////////////////////////////////////////////////////////////////////////
	template <
		::mcu::clock::osc_type::osc_type	type,
		uint32_t							Clock_Hz = 0,
		::mcu::clock::state::state			state = ::mcu::clock::state::enable,
		int32_t								calibration = ::mcu::clock::CALIBRATION_DEF
		>
	class osc
	{
	public:
		typedef config::osc_cfg<type, Clock_Hz, state, calibration> _cfg_;
		
		static const uint32_t	_Clock_Hz		= _cfg_::_Clock_Hz;

		static void init()
		{
			_cfg_::init();
		}
		
		static void enable(::mcu::clock::state::state new_state)
		{
			(new_state == ::mcu::clock::state::enable) ? start() : stop();
		}
			
		static void start()
		{
			// enabling
			_cfg_::start();
		}
		
		static void stop()
		{
			// disabling
			_cfg_::stop();
		}
	};

	//------------------------------------------------------------------------
	typedef osc< ::mcu::clock::osc_type::high_speed_internal		, HSI_VALUE> osc_hsi;
	typedef osc< ::mcu::clock::osc_type::low_speed_internal			, LSI_VALUE> osc_lsi;

	typedef osc< ::mcu::clock::osc_type::high_speed_external		, METALLL_HSE_FREQ_HZ> osc_hse;
	typedef osc< ::mcu::clock::osc_type::high_speed_external_bypass	, METALLL_HSE_FREQ_HZ> osc_hse_bypass;
	typedef osc< ::mcu::clock::osc_type::low_speed_external			, METALLL_LSE_FREQ_HZ> osc_lse;
	typedef osc< ::mcu::clock::osc_type::low_speed_external_bypass	, METALLL_LSE_FREQ_HZ> osc_lse_bypass;


	//////////////////////////////////////////////////////////////////////////
	namespace config {
		
		template < ::mcu::clock::osc_type::osc_type type, typename OSC
					, uint32_t ClockMin_Hz, uint32_t ClockMax_Hz, bool maximal
					, ::mcu::clock::state::state state
					, bool pll_usb >
		class pll_cfg;

		namespace _internal_ {
			//------------------------------------------------------------------------
			template <uint32_t InClock_Hz, uint32_t ClockMin_Hz, uint32_t ClockMax_Hz, bool maximal, uint32_t pll_mul_min, uint32_t pll_mul_max>
			class pll_find_cfg
			{
			public:
				static const uint32_t	_freq_usb_min	= mcu::stm32::clock::limits::min::USBCLK;
				static const uint32_t	_freq_usb_max	= mcu::stm32::clock::limits::max::USBCLK;
				
				static const uint32_t	_InClock_Hz		= InClock_Hz	;
				static const uint32_t	_ClockMin_Hz	= ClockMin_Hz	;
				static const uint32_t	_ClockMax_Hz	= ClockMax_Hz	;
				static const bool		_maximal		= maximal		;
				static const uint32_t	_pll_mul_min	= pll_mul_min	;
				static const uint32_t	_pll_mul_max	= pll_mul_max	;
			};
			
			template <class CFG, int32_t find_dir, int32_t mul_value, uint32_t cnt>
			class pll_find_clock2
			{
				static const uint32_t freq			= mul_value * CFG::_InClock_Hz;
				
				static const bool freq_valid		= (freq >= CFG::_ClockMin_Hz && freq <= CFG::_ClockMax_Hz);
				
				typedef pll_find_clock2<CFG, find_dir, mul_value + find_dir, cnt - 1> pll_find_clock2_next;
				
			public:
				static const uint32_t pll_mul = (freq_valid) ?  mul_value : pll_find_clock2_next::pll_mul;
			};
			
			template <class CFG, int32_t find_dir, int32_t mul_value>
			class pll_find_clock2<CFG, find_dir, mul_value, 0>
			{
			public:
				static const uint32_t pll_mul = 0;
			};
			
			template <class CFG, bool maximal>
			class pll_find_clock
			{
			private:
				STATIC_ASSERT(maximal == CFG::_maximal, "internall error");
			
				typedef pll_find_clock2<CFG, -1, CFG::_pll_mul_max, (CFG::_pll_mul_max - CFG::_pll_mul_min)> _pll_mul_max;
				typedef pll_find_clock2<CFG, +1, CFG::_pll_mul_min, (CFG::_pll_mul_max - CFG::_pll_mul_min)> _pll_mul_min;
				
			public:
				static const uint32_t	pll_mul		= CFG::_maximal ? _pll_mul_max::pll_mul : _pll_mul_min::pll_mul;
				static const uint32_t	_Clock_Hz	= CFG::_InClock_Hz * pll_mul;
				static const bool		usb_div_1_5	= !(_Clock_Hz >= CFG::_freq_usb_min && _Clock_Hz <= CFG::_freq_usb_max);
				static const uint32_t	usb_clock	= usb_div_1_5 ? (uint32_t)(_Clock_Hz / 1.5) : _Clock_Hz;
				static const bool		usb_active	= usb_clock >= CFG::_freq_usb_min && usb_clock <= CFG::_freq_usb_max;
			};
			
			//------------------------------------------------------------------------
			template <uint32_t InClock_Hz, uint32_t ClockMin_Hz, uint32_t ClockMax_Hz, float usb_div, int32_t find_dir, int32_t mul_value, uint32_t cnt>
			class pll_find_usb_clock2
			{
				static const uint32_t freq			= mul_value * InClock_Hz;
				static const uint32_t freq_usb		= (bool)(usb_div > 0) ? mul_value * (uint32_t)(InClock_Hz / usb_div) : 0;
				static const uint32_t freq_usb_min	= mcu::stm32::clock::limits::min::USBCLK;
				static const uint32_t freq_usb_max	= mcu::stm32::clock::limits::max::USBCLK;
				
				static const bool freq_valid		= (freq >= ClockMin_Hz && freq <= ClockMax_Hz);
				static const bool usb_acceptable	= (bool)(usb_div > 0) ? (freq_usb >= freq_usb_min && freq_usb <= freq_usb_max) : true;
				
				typedef pll_find_usb_clock2<InClock_Hz, ClockMin_Hz, ClockMax_Hz, usb_div, find_dir, mul_value + find_dir, cnt - 1> pll_find_usb_clock2_next;
				
