svhelper/-SPL-/Inc/STM32F1xx/stm32f1xx_clock.hpp
			public:
				static const uint32_t pll_mul = (freq_valid && usb_acceptable) ?  mul_value : pll_find_usb_clock2_next::pll_mul;
			};
			
			template <uint32_t InClock_Hz, uint32_t ClockMin_Hz, uint32_t ClockMax_Hz, float usb_div, int32_t find_dir, int32_t mul_value>
			class pll_find_usb_clock2<InClock_Hz, ClockMin_Hz, ClockMax_Hz, usb_div, find_dir, mul_value, 0>
			{
			public:
				static const uint32_t pll_mul = 0;
			};
			
			template <class CFG, bool maximal>
			class pll_find_usb_clock;
			
			template <class CFG>
			class pll_find_usb_clock<CFG, true>
			{
			private:
				STATIC_ASSERT(true == CFG::_maximal, "internall error");
				
				static const uint32_t pll_mul_1_5 = pll_find_usb_clock2<
					CFG::_InClock_Hz, CFG::_ClockMin_Hz, CFG::_ClockMax_Hz,
					1.5,
					-1, CFG::_pll_mul_max, (CFG::_pll_mul_max - CFG::_pll_mul_min) + 1
					>::pll_mul;
				
				static const uint32_t pll_mul_1_0 = pll_find_usb_clock2<
					CFG::_InClock_Hz, CFG::_ClockMin_Hz, CFG::_ClockMax_Hz,
					1.0,
					-1, CFG::_pll_mul_max, (CFG::_pll_mul_max - CFG::_pll_mul_min) + 1
					>::pll_mul;
			
			public:
				static const bool		usb_div_1_5 = (CFG::_InClock_Hz * pll_mul_1_5) >= (CFG::_InClock_Hz * pll_mul_1_0);		// choice the maximal output frequency from PLL
				static const uint32_t	pll_mul = usb_div_1_5 ? pll_mul_1_5 : pll_mul_1_0;
				static const uint32_t	_Clock_Hz = CFG::_InClock_Hz * pll_mul;
				static const uint32_t	usb_clock	= usb_div_1_5 ? (uint32_t)(_Clock_Hz / 1.5) : _Clock_Hz;
				static const bool		usb_active	= usb_clock >= CFG::_freq_usb_min && usb_clock <= CFG::_freq_usb_max;
			};
			
			template <class CFG>
			class pll_find_usb_clock<CFG, false>
			{
			private:
				static const uint32_t pll_mul_1_5 = pll_find_usb_clock2<
					CFG::_InClock_Hz, CFG::_ClockMin_Hz, CFG::_ClockMax_Hz,
					1.5,
					+1, CFG::_pll_mul_min, (CFG::_pll_mul_max - CFG::_pll_mul_min) + 1
					>::pll_mul;
				
				static const uint32_t pll_mul_1_0 = pll_find_usb_clock2<
					CFG::_InClock_Hz, CFG::_ClockMin_Hz, CFG::_ClockMax_Hz,
					1.0,
					+1, CFG::_pll_mul_min, (CFG::_pll_mul_max - CFG::_pll_mul_min) + 1
					>::pll_mul;

			public:
				static const bool		usb_div_1_5	= pll_mul_1_5 && (CFG::_InClock_Hz * pll_mul_1_5) < (CFG::_InClock_Hz * pll_mul_1_0);		// choice the minimal output frequency from PLL
				static const uint32_t	pll_mul		= usb_div_1_5 ? pll_mul_1_5 : pll_mul_1_0;
				static const uint32_t	_Clock_Hz	= CFG::_InClock_Hz * pll_mul;
				static const uint32_t	usb_clock	= usb_div_1_5 ? (uint32_t)(_Clock_Hz / 1.5) : _Clock_Hz;
				static const bool		usb_active	= usb_clock >= CFG::_freq_usb_min && usb_clock <= CFG::_freq_usb_max;
			};
			
			//------------------------------------------------------------------------
			template <class CFG, bool usb, int32_t find_dir, int32_t prediv_value, uint32_t cnt>
			class pll_find_clock_prediv2
			{
				typedef pll_find_cfg<CFG::_InClock_Hz / prediv_value, CFG::_ClockMin_Hz, CFG::_ClockMax_Hz,
					CFG::_maximal, CFG::_pll_mul_min, CFG::_pll_mul_max> _cfg_;
				
				typedef pll_find_usb_clock	< _cfg_, _cfg_::_maximal >	_pll_usb_cfg;
				typedef pll_find_clock		< _cfg_, _cfg_::_maximal >	_pll_cfg;
				
				typedef pll_find_clock_prediv2<CFG, usb, find_dir, prediv_value + find_dir, cnt - 1> pll_find_clock_prediv2_next;
				
			public:
				static const uint32_t prediv =
					(usb && _pll_usb_cfg::pll_mul)	? prediv_value :
					(!usb && _pll_cfg::pll_mul)		? prediv_value :
					pll_find_clock_prediv2_next::prediv;
			};
			
			template <class CFG, bool usb, int32_t find_dir, int32_t prediv_value>
			class pll_find_clock_prediv2<CFG, usb, find_dir, prediv_value, 0>
			{
			public:
				static const uint32_t prediv = 0;
			};

			template <class CFG, bool usb, uint32_t prediv_min, uint32_t prediv_max>
			class pll_find_clock_prediv
			{
				typedef pll_find_clock_prediv2<CFG, usb, +1, prediv_min, (prediv_max - prediv_min)+1> _pll_find_max;
				typedef pll_find_clock_prediv2<CFG, usb, -1, prediv_max, (prediv_max - prediv_min)+1> _pll_find_min;
				
			public:
				static const uint32_t	pll_prediv	= CFG::_maximal ? _pll_find_max::prediv : _pll_find_min::prediv;
			
			private:
				typedef pll_find_cfg<pll_prediv ? CFG::_InClock_Hz / pll_prediv : 0, CFG::_ClockMin_Hz, CFG::_ClockMax_Hz,
					CFG::_maximal, CFG::_pll_mul_min, CFG::_pll_mul_max> _cfg_;
				
				typedef pll_find_usb_clock	< _cfg_, _cfg_::_maximal >	_pll_usb_cfg;
				typedef pll_find_clock		< _cfg_, _cfg_::_maximal >	_pll_cfg;

			public:
				static const bool		usb_div_1_5	= usb ? _pll_usb_cfg::usb_div_1_5	: _pll_cfg::usb_div_1_5	;
				static const uint32_t	pll_mul		= usb ? _pll_usb_cfg::pll_mul		: _pll_cfg::pll_mul		;
				static const uint32_t	_Clock_Hz	= usb ? _pll_usb_cfg::_Clock_Hz		: _pll_cfg::_Clock_Hz	;
				static const uint32_t	usb_clock	= usb ? _pll_usb_cfg::usb_clock		: _pll_cfg::usb_clock	;
				static const bool		usb_active	= usb ? _pll_usb_cfg::usb_active	: _pll_cfg::usb_active	;
			};
		} // namespace _internal_
		using namespace _internal_;
		
		//------------------------------------------------------------------------
		template < typename OSC
					, uint32_t ClockMin_Hz, uint32_t ClockMax_Hz, bool maximal
					, ::mcu::clock::state::state state
					, bool pll_usb >
		class pll_cfg< ::mcu::clock::osc_type::high_speed_internal, OSC, ClockMin_Hz, ClockMax_Hz, maximal, state, pll_usb>
		{
		private:
			typedef OSC osc;

			typedef pll_find_clock_prediv< pll_find_cfg<osc::_cfg_::_Clock_Hz, ClockMin_Hz, ClockMax_Hz, maximal, 2UL, 16UL>, pll_usb, 2, 2 >	_pll_cfg;

			static const uint32_t _RCC_CR_PLLON_BB		= FROM_ADDRESS_BIT_POS_TO_BB(&RCC->CR, RCC_CR_PLLON_Pos);
			static const uint32_t _RCC_CR_PLLRDY_BB		= FROM_ADDRESS_BIT_POS_TO_BB(&RCC->CR, RCC_CR_PLLRDY_Pos);

		public:
			static const ::mcu::clock::osc_type::osc_type	_OscType		= osc::_cfg_::_OscType;
			static const uint32_t							_Clock_Hz		= _pll_cfg::_Clock_Hz;
			static const ::mcu::clock::state::state			_State			= state;
			static const int32_t							_Calibration	= ::mcu::clock::CALIBRATION_DEF;
		
			static const uint32_t							_pll_prediv		= _pll_cfg::pll_prediv	;
			static const bool								_usb_div_1_5	= _pll_cfg::usb_div_1_5	;
			static const uint32_t							_pll_mul		= _pll_cfg::pll_mul		;
			static const uint32_t							_usb_clock		= _pll_cfg::usb_clock	;
			static const bool								_usb_active		= _pll_cfg::usb_active	;
		
			STATIC_ASSERT(_pll_mul >= 2 && _pll_mul <= 16, "The required clock frequency cannot be reached");
			STATIC_ASSERT(!pll_usb || _usb_active, "PLL cannot find clock frequency for USB");

