svhelper/-SPL-/Inc/STM32F1xx/stm32f1xx_clock.hpp
		public:
			static void init()
			{
				(_State == ::mcu::clock::state::enable) ? start() : stop();
			}
			
			static void enable(::mcu::clock::state::state new_state)
			{
				(new_state == ::mcu::clock::state::enable) ? start() : stop();
			}
			
			static void start()
			{
//				if(READ_BIT(RCC->CFGR, RCC_CFGR_SWS_Msk) == RCC_CFGR_SWS_PLL)
//				{
//					return;
//				}
				
				// enabling
				osc::start();

				/* Disable the main PLL. */
				RESET_BB_REG(_RCC_CR_PLLON_BB);

				/* Wait till PLL is disabled */
				while(IS_BB_REG_SET(_RCC_CR_PLLRDY_BB)) {}

				/* Configure the main PLL clock source and multiplication factors. */
				MODIFY_REG(RCC->CFGR, (RCC_CFGR_PLLSRC_Msk | RCC_CFGR_PLLMULL_Msk), ((0 /*RCC_CFGR_PLLSRC*/) | ((_pll_mul - 2) << RCC_CFGR_PLLMULL_Pos) ));

				/* Enable the main PLL. */
				SET_BB_REG(_RCC_CR_PLLON_BB);

				/* Wait till PLL is ready */
				while(IS_BB_REG_RESET(_RCC_CR_PLLRDY_BB)) {}
			}
			
			static void stop()
			{
				// disabling
				/* Disable the main PLL. */
				RESET_BB_REG(_RCC_CR_PLLON_BB);

				/* Wait till PLL is disabled */
				while(IS_BB_REG_SET(_RCC_CR_PLLRDY_BB)) {}
				
				osc::stop();
			}
		};

		//------------------------------------------------------------------------
		template < typename OSC
					, uint32_t ClockMin_Hz, uint32_t ClockMax_Hz, bool maximal
					, ::mcu::clock::state::state state
					, bool pll_usb >
		class pll_cfg< ::mcu::clock::osc_type::high_speed_external, OSC, ClockMin_Hz, ClockMax_Hz, maximal, state, pll_usb>
		{
		private:
			typedef OSC osc;
			typedef pll_find_clock_prediv< pll_find_cfg<osc::_cfg_::_Clock_Hz, ClockMin_Hz, ClockMax_Hz, maximal, 2UL, 16UL>, pll_usb, 1, 2 >	_pll_cfg;

			static const uint32_t _RCC_CR_PLLON_BB		= FROM_ADDRESS_BIT_POS_TO_BB(&RCC->CR, RCC_CR_PLLON_Pos);
			static const uint32_t _RCC_CR_PLLRDY_BB		= FROM_ADDRESS_BIT_POS_TO_BB(&RCC->CR, RCC_CR_PLLRDY_Pos);
			static const uint32_t _RCC_CFGR_PLLXTPRE_BB	= FROM_ADDRESS_BIT_POS_TO_BB(&RCC->CFGR, RCC_CFGR_PLLXTPRE_Pos);

		public:
			static const ::mcu::clock::osc_type::osc_type	_OscType		= osc::_cfg_::_OscType;
			static const uint32_t							_Clock_Hz		= _pll_cfg::_Clock_Hz;
			static const ::mcu::clock::state::state			_State			= state;
			static const int32_t							_Calibration	= ::mcu::clock::CALIBRATION_DEF;
		
			static const uint32_t							_pll_prediv		= _pll_cfg::pll_prediv	;
			static const bool								_usb_div_1_5	= _pll_cfg::usb_div_1_5	;
			static const uint32_t							_pll_mul		= _pll_cfg::pll_mul		;
			static const uint32_t							_usb_clock		= _pll_cfg::usb_clock	;
			static const bool								_usb_active		= _pll_cfg::usb_active	;
		
			STATIC_ASSERT(_pll_mul >= 2 && _pll_mul <= 16, "The required clock frequency cannot be reached");
			STATIC_ASSERT(!pll_usb || _usb_active, "PLL cannot find clock frequency for USB");

		public:
			static void init()
			{
				(_State == ::mcu::clock::state::enable) ? start() : stop();
			}
			
			static void Enable(::mcu::clock::state::state new_state)
			{
				(new_state == ::mcu::clock::state::enable) ? start() : stop();
			}
			
			static void start()
			{
//				if(READ_BIT(RCC->CFGR, RCC_CFGR_SWS_Msk) == RCC_CFGR_SWS_PLL)
//				{
//					return;
//				}
				
				// enabling
				osc::start();

				/* Disable the main PLL. */
				RESET_BB_REG(_RCC_CR_PLLON_BB);

				/* Wait till PLL is disabled */
				while(IS_BB_REG_SET(_RCC_CR_PLLRDY_BB)) {}

				/* Set PREDIV1 Value */
				WRITE_BB_REG(_RCC_CFGR_PLLXTPRE_BB, _pll_prediv == 1 ? 0 : 1);
				//MODIFY_REG(RCC->CFGR, RCC_CFGR_PLLXTPRE_Msk, (uint32_t)(pll_prediv == 1 ? 0 : RCC_CFGR_PLLXTPRE));
				
				/* Configure the main PLL clock source and multiplication factors. */
				MODIFY_REG(RCC->CFGR, (RCC_CFGR_PLLSRC_Msk | RCC_CFGR_PLLMULL_Msk), ((RCC_CFGR_PLLSRC) | ((_pll_mul - 2) << RCC_CFGR_PLLMULL_Pos) ));

				/* Enable the main PLL. */
				SET_BB_REG(_RCC_CR_PLLON_BB);

				/* Wait till PLL is ready */
				while(IS_BB_REG_RESET(_RCC_CR_PLLRDY_BB)) {}
			}
			
			static void stop()
			{
				// disabling
				osc::stop();
			}
		};

		//------------------------------------------------------------------------
		template < typename OSC
					, uint32_t ClockMin_Hz, uint32_t ClockMax_Hz, bool maximal
					, ::mcu::clock::state::state state
					, bool pll_usb >
		class pll_cfg< ::mcu::clock::osc_type::high_speed_external_bypass, OSC, ClockMin_Hz, ClockMax_Hz, maximal, state, pll_usb>
			: public pll_cfg< ::mcu::clock::osc_type::high_speed_external, OSC, ClockMin_Hz, ClockMax_Hz, maximal, state, pll_usb>
		{
		};
	} // namespace config

	//////////////////////////////////////////////////////////////////////////
	template <
		class						OSC,
		uint32_t					ClockMin_Hz		= ::mcu::stm32::clock::limits::max::SYSCLK,
		uint32_t					ClockMax_Hz		= ::mcu::stm32::clock::limits::max::SYSCLK,
		bool						maximal			= true,
		bool						usb				= true,
		::mcu::clock::state::state	state			= ::mcu::clock::state::enable
		>
	class pll_auto_range
	{
	protected:
		STATIC_ASSERT(ClockMin_Hz <= ::mcu::stm32::clock::limits::max::SYSCLK, "The PLL clock is out of range");
		STATIC_ASSERT(ClockMax_Hz <= ::mcu::stm32::clock::limits::max::SYSCLK, "The PLL clock is out of range");
		STATIC_ASSERT(ClockMin_Hz <= ClockMax_Hz, "Wrong range for PLL clock");

	public:
		typedef config::pll_cfg<OSC::_cfg_::_OscType, OSC, ClockMin_Hz, ClockMax_Hz, maximal, state, usb> _cfg_;
	
	public:
		static void init()
		{
			_cfg_::init();
		}

		static void enable(::mcu::clock::state::state new_state)
		{
			(new_state == ::mcu::clock::state::enable) ? start() : stop();
		}
			
		static void start()
		{
			// enabling
			_cfg_::start();
		}
		
		static void stop()
		{
			// disabling
			_cfg_::stop();
		}
	};


	//////////////////////////////////////////////////////////////////////////
	template <
		class					ClockSource											,
		uint32_t				HCLK_Max_Hz					= limits::max::HCLK		,
		uint32_t				APB1CLK_Max_Hz				= limits::max::APB1CLK	,
		uint32_t				APB2CLK_Max_Hz				= limits::max::APB2CLK	,
		uint32_t				CortexSysTimer_Max_Hz		= 1000000/*Hz*/ / 1000/*ms*/	,		// limits::max::HCLK
		uint32_t				ADCCLK_Max_Hz				= limits::max::ADCCLK	
		>
	class sysclock_auto
	{
	public:
		class _cfg_
		{
		protected:
			typedef ClockSource osc;
			
