svhelper/-SPL-/Inc/STM32F1xx/stm32f1xx_clock.hpp
			STATIC_ASSERT(	osc::_cfg_::_OscType == ::mcu::clock::osc_type::high_speed_internal			||
							osc::_cfg_::_OscType == ::mcu::clock::osc_type::high_speed_external			||
							osc::_cfg_::_OscType == ::mcu::clock::osc_type::high_speed_external_bypass
						, "Invalid source type for system clock");

			STATIC_ASSERT(HCLK_Max_Hz			>= limits::min::HCLK	/*&& HCLK_Max_Hz			<= limits::max::HCLK	*/ , "HCLK_Max_Hz			- Invalid parameter");
			STATIC_ASSERT(APB1CLK_Max_Hz		>= limits::min::APB1CLK	/*&& APB1CLK_Max_Hz			<= limits::max::APB1CLK	*/ , "APB1CLK_Max_Hz		- Invalid parameter");
			STATIC_ASSERT(APB2CLK_Max_Hz		>= limits::min::APB2CLK	/*&& APB2CLK_Max_Hz			<= limits::max::APB2CLK	*/ , "APB2CLK_Max_Hz		- Invalid parameter");
			STATIC_ASSERT(CortexSysTimer_Max_Hz	>= limits::min::HCLK	/*&& CortexSysTimer_Max_Hz	<= limits::max::HCLK	*/ , "CortexSysTimer_Max_Hz	- Invalid parameter");
			STATIC_ASSERT(ADCCLK_Max_Hz			>= limits::min::ADCCLK	/*&& ADCCLK_Max_Hz			<= limits::max::ADCCLK	*/ , "ADCCLK_Max_Hz			- Invalid parameter");
		
			STATIC_ASSERT(osc::_cfg_::_Clock_Hz >= limits::min::HCLK && osc::_cfg_::_Clock_Hz <= limits::max::HCLK, "Invalid source for system clock");

		public:
			static const ::mcu::clock::osc_type::osc_type	_OscType		= osc::_cfg_::_OscType;
			static const uint32_t							_Clock_Hz		= osc::_cfg_::_Clock_Hz;
			static const ::mcu::clock::state::state			_State			= osc::_cfg_::_State;
			static const int32_t							_Calibration	= osc::_cfg_::_Calibration;
		
			static const uint32_t							_pll_prediv		= osc::_cfg_::_pll_prediv	;
			static const bool								_usb_div_1_5	= osc::_cfg_::_usb_div_1_5	;
			static const uint32_t							_pll_mul		= osc::_cfg_::_pll_mul		;
			static const uint32_t							_usb_clock		= osc::_cfg_::_usb_clock	;
			static const bool								_usb_active		= osc::_cfg_::_usb_active	;
		
			//------------------------------------------------------------------------
			static const uint32_t	_ahb_div	=
				(_Clock_Hz /   1 <= HCLK_Max_Hz) ?   1 :
				(_Clock_Hz /   2 <= HCLK_Max_Hz) ?   2 :
				(_Clock_Hz /   4 <= HCLK_Max_Hz) ?   4 :
				(_Clock_Hz /   8 <= HCLK_Max_Hz) ?   8 :
				(_Clock_Hz /  16 <= HCLK_Max_Hz) ?  16 :
			//	(_Clock_Hz /  32 <= HCLK_Max_Hz) ?  32 :
				(_Clock_Hz /  64 <= HCLK_Max_Hz) ?  64 :
				(_Clock_Hz / 128 <= HCLK_Max_Hz) ? 128 :
				(_Clock_Hz / 256 <= HCLK_Max_Hz) ? 256 :
				(_Clock_Hz / 512 <= HCLK_Max_Hz) ? 512 :
				0;
			
			STATIC_ASSERT(_ahb_div > 0, "The required clock frequency for HCLK cannot be reached");

			static const uint32_t	_HCLK_Hz	= _Clock_Hz / _ahb_div;
			STATIC_ASSERT(_HCLK_Hz >= limits::min::HCLK	&& _HCLK_Hz <= limits::max::HCLK, "The required clock frequency for HCLK cannot be reached (or Invalid parameter HCLK_Max_Hz)");

			//------------------------------------------------------------------------
			static const uint32_t	_apb1_div	=
				(_HCLK_Hz /   1 <= APB1CLK_Max_Hz) ?   1 :
				(_HCLK_Hz /   2 <= APB1CLK_Max_Hz) ?   2 :
				(_HCLK_Hz /   4 <= APB1CLK_Max_Hz) ?   4 :
				(_HCLK_Hz /   8 <= APB1CLK_Max_Hz) ?   8 :
				(_HCLK_Hz /  16 <= APB1CLK_Max_Hz) ?  16 :
				0;

			STATIC_ASSERT(_apb1_div > 0, "The required clock frequency for APB1 cannot be reached");

			static const uint32_t	_PCLK1_Hz	= _HCLK_Hz / _apb1_div;
			STATIC_ASSERT(_PCLK1_Hz >= limits::min::APB1CLK	&& _PCLK1_Hz <= limits::max::APB1CLK, "The required clock frequency for APB1 cannot be reached (or Invalid parameter APB1CLK_Max_Hz)");

			//------------------------------------------------------------------------
			static const uint32_t	_apb2_div	=
				(_HCLK_Hz /   1 <= APB2CLK_Max_Hz) ?   1 :
				(_HCLK_Hz /   2 <= APB2CLK_Max_Hz) ?   2 :
				(_HCLK_Hz /   4 <= APB2CLK_Max_Hz) ?   4 :
				(_HCLK_Hz /   8 <= APB2CLK_Max_Hz) ?   8 :
				(_HCLK_Hz /  16 <= APB2CLK_Max_Hz) ?  16 :
				0;

			STATIC_ASSERT(_apb2_div > 0, "The required clock frequency for APB2 cannot be reached");

			static const uint32_t	_PCLK2_Hz	= _HCLK_Hz / _apb2_div;
			STATIC_ASSERT(_PCLK2_Hz >= limits::min::APB2CLK	&& _PCLK2_Hz <= limits::max::APB2CLK, "The required clock frequency for APB2 cannot be reached (or Invalid parameter APB2CLK_Max_Hz)");
			
			//------------------------------------------------------------------------
			static const uint32_t	_CortexSysTimer_div	=
				(_HCLK_Hz / SysTick_LOAD_RELOAD_Msk / 1 <= CortexSysTimer_Max_Hz) ? 1 :
				(_HCLK_Hz / SysTick_LOAD_RELOAD_Msk / 8 <= CortexSysTimer_Max_Hz) ? 8 :
				0;

			STATIC_ASSERT(_CortexSysTimer_div > 0, "The required clock frequency for CortexSysTimer cannot be reached");

			static const uint32_t	_CortexSysTimer_load	= _HCLK_Hz / CortexSysTimer_Max_Hz / _CortexSysTimer_div;
			STATIC_ASSERT((_CortexSysTimer_load-1) <= SysTick_LOAD_RELOAD_Msk, "The required clock frequency for CortexSysTimer cannot be reached (or Invalid parameter CortexSysTimer_Max_Hz)");
			
			static const uint32_t	_CortexSysTimer_Hz	= _HCLK_Hz / _CortexSysTimer_load / _CortexSysTimer_div;
			STATIC_ASSERT(_CortexSysTimer_Hz >= limits::min::HCLK && _CortexSysTimer_Hz <= limits::max::HCLK, "The required clock frequency for CortexSysTimer cannot be reached (or Invalid parameter CortexSysTimer_Max_Hz)");
			
			//------------------------------------------------------------------------
			static const uint32_t	_ADC_div	=
				(_PCLK2_Hz / 2 <= ADCCLK_Max_Hz) ? 2 :
				(_PCLK2_Hz / 4 <= ADCCLK_Max_Hz) ? 4 :
				(_PCLK2_Hz / 6 <= ADCCLK_Max_Hz) ? 6 :
				(_PCLK2_Hz / 8 <= ADCCLK_Max_Hz) ? 8 :
				0;

			STATIC_ASSERT(_ADC_div > 0, "The required clock frequency for ADC cannot be reached");

			static const uint32_t	_ADC_Hz	= _PCLK2_Hz / _ADC_div;
			STATIC_ASSERT(_ADC_Hz >= limits::min::ADCCLK && _ADC_Hz <= limits::max::ADCCLK, "The required clock frequency for ADC cannot be reached (or Invalid parameter ADCCLK_Max_Hz)");
			
			//------------------------------------------------------------------------
#if defined(FLASH_ACR_LATENCY)
			static const uint32_t	_flash_latency	=
				(_HCLK_Hz <= limits::max::FLASHCLK_LATENCY_0_Hz) ? 0 :			// Zero wait state
				(_HCLK_Hz <= limits::max::FLASHCLK_LATENCY_1_Hz) ? 1 :			// One wait state
				(_HCLK_Hz <= limits::max::FLASHCLK_LATENCY_2_Hz) ? 2 :			// Two wait states
				0xFFFFFFFF;

			STATIC_ASSERT(_flash_latency <= 2, "internal error: Invalid Clock Source frequency");

#else /* FLASH_ACR_LATENCY */
			static const uint32_t	_flash_latency	= 0;
			
#endif /* FLASH_ACR_LATENCY */

			//------------------------------------------------------------------------
			static const uint32_t	_rcc_cfgr_hpre_div =
				(_ahb_div ==   1) ? RCC_CFGR_HPRE_DIV1   :
				(_ahb_div ==   2) ? RCC_CFGR_HPRE_DIV2   :
				(_ahb_div ==   4) ? RCC_CFGR_HPRE_DIV4   :
				(_ahb_div ==   8) ? RCC_CFGR_HPRE_DIV8   :
				(_ahb_div ==  16) ? RCC_CFGR_HPRE_DIV16  :
			//	(_ahb_div ==  32) ? RCC_CFGR_HPRE_DIV32  :
				(_ahb_div ==  64) ? RCC_CFGR_HPRE_DIV64  :
				(_ahb_div == 128) ? RCC_CFGR_HPRE_DIV128 :
				(_ahb_div == 256) ? RCC_CFGR_HPRE_DIV256 :
				(_ahb_div == 512) ? RCC_CFGR_HPRE_DIV512 :
				0;

			static const uint32_t _flash_acr_latency	= _flash_latency << FLASH_ACR_LATENCY_Pos;

			static const uint32_t _rcc_cfgr_sw =
				(_pll_mul > 1)														?	RCC_CFGR_SW_PLL :
				(_OscType == ::mcu::clock::osc_type::high_speed_internal)			?	RCC_CFGR_SW_HSI :
				(_OscType == ::mcu::clock::osc_type::high_speed_external)			?	RCC_CFGR_SW_HSE :
				(_OscType == ::mcu::clock::osc_type::high_speed_external_bypass)	?	RCC_CFGR_SW_HSE :
																						RCC_CFGR_SW_HSI;
			
			static const uint32_t _rcc_cfgr_sws =
				(_pll_mul > 1)														?	RCC_CFGR_SWS_PLL :
				(_OscType == ::mcu::clock::osc_type::high_speed_internal)			?	RCC_CFGR_SWS_HSI :
				(_OscType == ::mcu::clock::osc_type::high_speed_external)			?	RCC_CFGR_SWS_HSE :
				(_OscType == ::mcu::clock::osc_type::high_speed_external_bypass)	?	RCC_CFGR_SWS_HSE :
																						RCC_CFGR_SWS_HSI;

			static const uint32_t	_rcc_cfgr_ppre1	=
				(_apb1_div ==  1) ?	RCC_CFGR_PPRE1_DIV1  :
				(_apb1_div ==  2) ?	RCC_CFGR_PPRE1_DIV2  :
				(_apb1_div ==  4) ?	RCC_CFGR_PPRE1_DIV4  :
				(_apb1_div ==  8) ?	RCC_CFGR_PPRE1_DIV8  :
				(_apb1_div == 16) ?	RCC_CFGR_PPRE1_DIV16 :
									RCC_CFGR_PPRE1_DIV16;

			static const uint32_t	_rcc_cfgr_ppre2 = 
				(_apb2_div ==  1) ?	RCC_CFGR_PPRE2_DIV1  :
				(_apb2_div ==  2) ?	RCC_CFGR_PPRE2_DIV2  :
				(_apb2_div ==  4) ?	RCC_CFGR_PPRE2_DIV4  :
				(_apb2_div ==  8) ?	RCC_CFGR_PPRE2_DIV8  :
				(_apb2_div == 16) ?	RCC_CFGR_PPRE2_DIV16 :
									RCC_CFGR_PPRE2_DIV16;

			static const uint32_t	_rcc_cfgr_adcpre =
				(_ADC_div == 2) ? RCC_CFGR_ADCPRE_DIV2 :
				(_ADC_div == 4) ? RCC_CFGR_ADCPRE_DIV4 :
				(_ADC_div == 6) ? RCC_CFGR_ADCPRE_DIV6 :
				(_ADC_div == 8) ? RCC_CFGR_ADCPRE_DIV8 :
				0;
			
			static const uint32_t _rcc_cfgr_usbpre = _usb_div_1_5 ? 0 : RCC_CFGR_USBPRE;

			//------------------------------------------------------------------------
			
