svhelper/-SPL-/Inc/STM32F1xx/stm32f1xx_clock.hpp
		public:
			static void init()
			{
#if defined(FLASH_ACR_PRFTBE)
				FLASH->ACR |= FLASH_ACR_PRFTBE;
#endif /* FLASH_ACR_PRFTBE */
				
				// Set Interrupt Group Priority
				NVIC_SetPriorityGrouping(NVIC_PRIORITYGROUP);

#if defined(FLASH_ACR_LATENCY)
				// Set maximal safe FLASH LATENCY during switching
				MODIFY_REG(FLASH->ACR, FLASH_ACR_LATENCY_Msk, 2 << FLASH_ACR_LATENCY_Pos);
#endif /* FLASH_ACR_LATENCY */

				// HCLK Configuration
				MODIFY_REG(RCC->CFGR, RCC_CFGR_HPRE_Msk, _rcc_cfgr_hpre_div);
				
				// SYSCLK Configuration
				osc::init();														// Clock Source Initialization

				// if(_pll_mul)
				// {
				// 	// PLL is selected as System Clock Source
				// 	static const uint32_t _RCC_CR_PLLRDY_BB		= FROM_ADDRESS_BIT_POS_TO_BB(&RCC->CR, RCC_CR_PLLRDY_Pos);
				// 	
				// 	if(IS_BB_REG_RESET(_RCC_CR_PLLRDY_BB))			// Check the PLL ready
				// 		return;
				// }
				// else if(_OscType == ::mcu::clock::osc_type::high_speed_internal)
				// {
				// 	// HSI is selected as System Clock Source
				// 	static const uint32_t _RCC_CR_HSIRDY_BB	= FROM_ADDRESS_BIT_POS_TO_BB(&RCC->CR, RCC_CR_HSIRDY_Pos);
				// 	
				// 	if(IS_BB_REG_RESET(_RCC_CR_HSIRDY_BB))			// Check the HSI ready
				// 		return;
				// }
				// else if(_OscType == ::mcu::clock::osc_type::high_speed_external || _OscType == ::mcu::clock::osc_type::high_speed_external_bypass)
				// {
				// 	// HSE is selected as System Clock Source
				// 	static const uint32_t _RCC_CR_HSERDY_BB	= FROM_ADDRESS_BIT_POS_TO_BB(&RCC->CR, RCC_CR_HSERDY_Pos);
				// 	
				// 	if(IS_BB_REG_RESET(_RCC_CR_HSERDY_BB))			// Check the HSE ready
				// 		return;			// FAILED
				// }
				// else
				// {
				// 	STATIC_ASSERT(false, "internal error: Invalid Clock Source type");
				// }

				MODIFY_REG(RCC->CFGR, RCC_CFGR_SW_Msk, _rcc_cfgr_sw);					// Switching to Clock Source
				
				while(READ_BIT(RCC->CFGR, RCC_CFGR_SWS_Msk) != _rcc_cfgr_sws) {}		// Waiting for finalization

#if defined(FLASH_ACR_LATENCY)
				MODIFY_REG(FLASH->ACR, FLASH_ACR_LATENCY_Msk, _flash_acr_latency);		// Initialization FLASH LATENCY
#endif /* FLASH_ACR_LATENCY */

				// PCLK1 Configuration
				MODIFY_REG(RCC->CFGR, RCC_CFGR_PPRE1_Msk, _rcc_cfgr_ppre1);

				// PCLK2 Configuration
				MODIFY_REG(RCC->CFGR, RCC_CFGR_PPRE2_Msk, _rcc_cfgr_ppre2);

				// Configure the SysTick to have interrupt in 1ms time basis
				SysTick_Config(_CortexSysTimer_load);
				(_CortexSysTimer_div == 1) ?	(void)(SysTick->CTRL |= SYSTICK_CLKSOURCE_HCLK) :
				(_CortexSysTimer_div == 8) ?	(void)(SysTick->CTRL &= ~SYSTICK_CLKSOURCE_HCLK) :
												(void)0;

				// Configure the SysTick IRQ priority
				//NVIC_SetPriority(SysTick_IRQn, NVIC_EncodePriority(NVIC_PRIORITYGROUP /*NVIC_GetPriorityGrouping()*/, TICK_INT_PRIORITY, 0));

				// Configure the ADC clock source
				MODIFY_REG(RCC->CFGR, RCC_CFGR_ADCPRE_Msk, _rcc_cfgr_adcpre);

				// Configure the USB clock source
				MODIFY_REG(RCC->CFGR, RCC_CFGR_USBPRE_Msk, _rcc_cfgr_usbpre);
			}
		};
		
	public:
		static void init()
		{
			_cfg_::init();
		}
	};
	
//////////////////////////////////////////////////////////////////////////
} // namespace clock
} // namespace stm32

/************************************************************************/
/*                                                                      */
/************************************************************************/


namespace clock {

template < state::state state, int32_t calibration, uint32_t Clock_Hz >
class osc_hsi : public ::mcu::stm32::clock::osc< osc_type::high_speed_internal, Clock_Hz == CLOCK_HZ_DEF ? HSI_VALUE : Clock_Hz, state, calibration> {};

template < state::state state, uint32_t Clock_Hz >
class osc_lsi : public ::mcu::stm32::clock::osc< osc_type::low_speed_internal, Clock_Hz == CLOCK_HZ_DEF ? LSI_VALUE : Clock_Hz, state > {};

template < state::state state, uint32_t Clock_Hz >
class osc_hse : public ::mcu::stm32::clock::osc< osc_type::high_speed_external, Clock_Hz == CLOCK_HZ_DEF ? METALLL_HSE_FREQ_HZ : Clock_Hz, state > {};

template < state::state state, uint32_t Clock_Hz >
class osc_hse_bypass : public ::mcu::stm32::clock::osc< osc_type::high_speed_external_bypass, Clock_Hz == CLOCK_HZ_DEF ? METALLL_HSE_FREQ_HZ : Clock_Hz, state > {};

template < state::state state, uint32_t Clock_Hz >
class osc_lse : public ::mcu::stm32::clock::osc< osc_type::low_speed_external, Clock_Hz == CLOCK_HZ_DEF ? METALLL_LSE_FREQ_HZ : Clock_Hz, state > {};

template < state::state state, uint32_t Clock_Hz >
class osc_lse_bypass : public ::mcu::stm32::clock::osc< osc_type::low_speed_external_bypass, Clock_Hz == CLOCK_HZ_DEF ? METALLL_LSE_FREQ_HZ : Clock_Hz, state > {};

//////////////////////////////////////////////////////////////////////////	
template < state::state state > class pll_hsi
	: public ::mcu::stm32::clock::pll_auto_range< osc_hsi_def, ::mcu::stm32::clock::limits::min::SYSCLK, ::mcu::stm32::clock::limits::max::SYSCLK, true, false, state >
{};

template < state::state state > class pll_hse
	: public ::mcu::stm32::clock::pll_auto_range< osc_hse_def, ::mcu::stm32::clock::limits::min::SYSCLK, ::mcu::stm32::clock::limits::max::SYSCLK, true, true, state >
{};

template < state::state state > class pll_hse_bypass
	: public ::mcu::stm32::clock::pll_auto_range< osc_hse_bypass_def, ::mcu::stm32::clock::limits::min::SYSCLK, ::mcu::stm32::clock::limits::max::SYSCLK, true, true, state >
{};

//------------------------------------------------------------------------
template< class OSC, uint32_t Clock_Hz = ::mcu::stm32::clock::limits::max::SYSCLK, state::state state = state::enable >
class pll_auto : public ::mcu::stm32::clock::pll_auto_range< OSC, Clock_Hz, Clock_Hz, true, false, state > {};

template< class OSC, uint32_t ClockMin_Hz = ::mcu::stm32::clock::limits::max::SYSCLK, uint32_t ClockMax_Hz = ::mcu::stm32::clock::limits::max::SYSCLK, state::state state = state::enable >
class pll_min : public ::mcu::stm32::clock::pll_auto_range< OSC, ClockMin_Hz, ClockMax_Hz, false, false, state > {};

template< class OSC, uint32_t ClockMin_Hz = ::mcu::stm32::clock::limits::max::SYSCLK, uint32_t ClockMax_Hz = ::mcu::stm32::clock::limits::max::SYSCLK, state::state state = state::enable >
class pll_max : public ::mcu::stm32::clock::pll_auto_range< OSC, ClockMin_Hz, ClockMax_Hz, true, false, state > {};

template< class OSC, uint32_t Clock_Hz = ::mcu::stm32::clock::limits::max::SYSCLK, state::state state = state::enable >
class pll_usb_auto : public ::mcu::stm32::clock::pll_auto_range< OSC, Clock_Hz, Clock_Hz, true, true, state > {};

template< class OSC, uint32_t ClockMin_Hz = ::mcu::stm32::clock::limits::max::SYSCLK, uint32_t ClockMax_Hz = ::mcu::stm32::clock::limits::max::SYSCLK, state::state state = state::enable >
class pll_usb_min : public ::mcu::stm32::clock::pll_auto_range< OSC, ClockMin_Hz, ClockMax_Hz, false, true, state > {};

template< class OSC, uint32_t ClockMin_Hz = ::mcu::stm32::clock::limits::max::SYSCLK, uint32_t ClockMax_Hz = ::mcu::stm32::clock::limits::max::SYSCLK, state::state state = state::enable >
class pll_usb_max : public ::mcu::stm32::clock::pll_auto_range< OSC, ClockMin_Hz, ClockMax_Hz, true, true, state > {};


//////////////////////////////////////////////////////////////////////////	
template<
		class		ClockSource			,
		uint32_t	CortexSysTimer_ms	,
		uint32_t	Clock_Hz_Max		
	>
class sysclock_auto : public ::mcu::stm32::clock::sysclock_auto< ClockSource, Clock_Hz_Max,
	::mcu::stm32::clock::limits::max::APB1CLK, ::mcu::stm32::clock::limits::max::APB2CLK,
	1000000/*Hz*/ / CortexSysTimer_ms,
	::mcu::stm32::clock::limits::max::ADCCLK >
{};

template<
		class		ClockSource,
		uint32_t	CortexSysTimer_ms
	>
class sysclock_max : public sysclock_auto< ClockSource, CortexSysTimer_ms > {};

} // namespace clock

/************************************************************************/
/*                                                                      */
/************************************************************************/
} // namespace mcu
//////////////////////////////////////////////////////////////////////////
#endif /*__stm32f1xx_clock_hpp__*/
